{
  "feed": [
    {
      "name": "Straw Hat",
      "totalBounty": 60000000,
      "image": "strawhat.jpg",
      "members": [
        {
          "name": "Brook",
          "crewName": "Brook",
          "name_jp": "ブルック",
          "image": "brook.jpg",
          "origin": "West Blue",
          "age": "90",
          "position": "Musician",
          "devilfruit": "Yomi Yomi no Mi",
          "summary": "\"Soul King\" Brook[16] is the musician of the Straw Hat Pirates, and one of their two swordsmen. He is the ninth member of the crew and the eighth to join,[17] doing so at the end of the Thriller Bark Arc.  Brook ate the Yomi Yomi no Mi, which allowed him to return to life after death once.[15] Brook eventually learned to tap deeper into the powers of his Devil Fruit, giving him significant control over his own soul and the souls of others. His dream is to reunite with his old friend, Laboon, at Reverse Mountain, where he resides with Crocus.[18]",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Swordman - Use devil fruit power + sword",
          "avatar": "brook_avatar.png",
          "bounty": 1500000
        },
        {
          "name": "Franky",
          "crewName": "Franky",
          "name_jp": "フランキー",
          "image": "franky.jpg",
          "origin": "South Blue",
          "age": "36",
          "position": "Shipwright",
          "devilfruit": "None",
          "summary": "\"Iron Man\" Franky[17][5] is the shipwright of the Straw Hat Pirates. He is the crew's eighth member and the seventh to join, doing so at the end of the Post-Enies Lobby Arc.[18]  Born \"Cutty Flam\",[19] he chose to go by his nickname of \"Franky\" until eventually permanently discarding his true name per the request of Iceburg to hide his identity.[20] Originally from the South Blue,[21] Franky was abandoned by his family as a four-year-old, eventually making his way to Water 7. There, he came to be a member of Tom's Workers, until an incident resulted in his body being heavily damaged and requiring him to augment himself into a cyborg. Upon returning to Water 7, he became the leader of the Franky Family, a group of ship dismantlers and bounty hunters.[2]",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Fighter - Use cyborg technology",
          "avatar": "franky_avatar.jpg",
          "bounty": 1500000
        },
        {
          "name": "Jimbei",
          "crewName": "Jimbei",
          "name_jp": "ジンベエ",
          "image": "jinbe.jpg",
          "origin": "Ryugu Kingdom",
          "age": "46",
          "position": "Helmsman",
          "devilfruit": "None",
          "summary": "\"Knight of the Sea\" Jinbe[1] is the helmsman of the Straw Hat Pirates. He is the tenth member of the crew and the ninth to join, doing so during the Wano Country Arc.[18]",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Fighter - Use karate skill + fishman jutsu",
          "avatar": "jinbe_avatar.jpg",
          "bounty": 1500000
        },
        {
          "name": "Monkey D. Luffy",
          "crewName": "Monkey D. Luffy",
          "name_jp": "モンキー・Dディー・ルフィ",
          "image": "luffy.jpg",
          "origin": "East Blue",
          "age": "19",
          "position": "Captain",
          "devilfruit": "Gum-Gum Fruit",
          "summary": "Monkey D. Luffy, also known as \" Straw Hat Luffy\" and commonly as \"Straw Hat\",[7] is the main protagonist of the manga and anime, One Piece. He is the founder and captain of the increasingly infamous and powerful Straw Hat Pirates, as well as one of its top fighters.[24] His lifelong dream is to become the Pirate King by finding the legendary treasure left behind by the late Gol D. Roger.[25] He believes that being the Pirate King means having the most freedom in the world.[26]  Born in Foosha Village, Luffy accidentally ate the Gomu Gomu no Mi at age 7, which turned his body into rubber.[27] He met \"Red-Haired\" Shanks, who gave Luffy the very Straw Hat that has become Luffy's signature accessory, having gifted it to the boy as part of a promise for them to meet again someday. Luffy is the son of the Revolutionary leader Monkey D. Dragon,[28] the grandson of the Marine hero Monkey D. Garp,[29] the sworn brother of the late \"Fire Fist\" Portgas D. Ace and Revolutionary Chief-of-Staff Sabo, and the foster son of Curly Dadan. He is one of the few people in the world who carries the Will of D.",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Fighter - Use Devil Fruit power with Haki",
          "avatar": "luffy_avatar.jpg",
          "bounty": 3000000
        },
        {
          "name": "Nami",
          "crewName": "Nami",
          "name_jp": "ナミ",
          "image": "nami.jpg",
          "origin": "East Blue",
          "age": "20",
          "position": "Navigator",
          "devilfruit": "None",
          "summary": "\"Cat Burglar\" Nami[6] is the navigator of the Straw Hat Pirates. She is the third member of the crew and the second to join, doing so during the Orange Town Arc.[20] She is the adoptive sister of Nojiko after the two were orphaned and taken in by Bell-mère.  She was formerly a member of the Arlong Pirates and initially joined the Straw Hats so that she could rob them in order to buy back her village from Arlong. However, she legitimately joined the Straw Hats after they rebelled against and defeated Arlong. Her dream is to make a map of the entire world.[21]",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Tool user - Use scientic electric tools plus Zeus ",
          "avatar": "nami_avatar.png",
          "bounty": 1500000
        },
        {
          "name": "Nico Robin",
          "crewName": "Nico Robin",
          "name_jp": "ニコ・ロビン",
          "image": "robin.jpg",
          "origin": "West Blue",
          "age": "30",
          "position": "Archaeologist",
          "devilfruit": "Hana Hana no Mi",
          "summary": "Nico Robin,[1] also known by her epithet \"Devil Child\"[6] and the \"Light of the Revolution\",[7] is the archaeologist of the Straw Hat Pirates. She is the seventh member of the crew and the sixth to join, doing so at the end of the Arabasta Arc. She temporarily left the crew during the Water 7 Arc, but rejoined during the Enies Lobby Arc.",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Devil Fruit User - use devil fruit power",
          "avatar": "robin_avatar.jpg",
          "bounty": 1500000
        },
        {
          "name": "Roronoa Zoro",
          "crewName": "Roronoa Zoro",
          "name_jp": "ロロノア・ゾロ",
          "image": "zoro.jpg",
          "origin": "East Blue",
          "age": "21",
          "position": "Vice-Captain",
          "devilfruit": "None",
          "summary": "Roronoa Zoro,[1] also known as \"Pirate Hunter\" Zoro,[7] is the combatant of the Straw Hat Pirates, and one of their two swordsmen. Formerly a bounty hunter,[5] he is the second member of Luffy's crew and the first to join it, doing so in the Romance Dawn Arc.[3]  As a master of Three Sword Style, a swordsmanship style which he created during his childhood training in Shimotsuki Village, Zoro is among the three most powerful combatants of the Straw Hats, alongside Luffy and Sanji.[19][20] His dream is to become the greatest swordsman in the world, in order to honor a promise he made to his deceased childhood friend Kuina.[21] In addition to his infamy as one of the Straw Hats and as a former bounty hunter, Zoro is also regarded as one of twelve pirates who are referred to as the \"Worst Generation\".[22]",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Swordman - Use three swords style with Haki",
          "avatar": "zoro_avatar.jpg",
          "bounty": 1500000
        },
        {
          "name": "Sanji",
          "crewName": "Sanji",
          "name_jp": "サンジ",
          "image": "sanji.jpg",
          "origin": "North Blue",
          "age": "21",
          "position": "Cook",
          "devilfruit": "None",
          "summary": "\"Black Leg\" Sanji,[6] born as Vinsmoke Sanji,[25][26][27] is the cook of the Straw Hat Pirates. He is the fifth member of the crew and the fourth to join, doing so at the end of the Baratie Arc.  Born as the third son and fourth child of the Vinsmoke Family[28] (thus making him a former prince of the Germa Kingdom), he disowned his family twice, once in his youth and again after reuniting with them as an adult.[29] After fleeing the Vinsmokes as a child, he eventually entered the care of Zeff as the sous chef of the Baratie, where he would remain until he met Monkey D. Luffy, who convinced him to join his crew.  His dream is to find the rumored chef's paradise, All Blue, which is where East Blue, West Blue, North Blue, and South Blue meet, along with their wildlife. He is one of the top three fighters of the Straw Hats, alongside Luffy and Zoro.  He currently has a bounty of Beli.png330,000,000, the third-highest in the crew after Luffy and Jinbe.[30] Despite renouncing his surname Vinsmoke,[26] the World Government labels it as part of his name on his wanted poster.[27]",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Fighter - Use legs with Haki",
          "avatar": "sanji_avatar.jpg",
          "bounty": 1500000
        },
        {
          "name": "Tony Tony Chopper",
          "crewName": "Tony Tony Chopper",
          "name_jp": "トニートニー・チョッパー",
          "image": "chopper.jpg",
          "origin": "Grand Line",
          "age": "17",
          "position": "Doctor",
          "devilfruit": "Hito Hito no Mi",
          "summary": "Tony Tony Chopper, also known as \"Cotton Candy Lover\" Chopper,[5] is the doctor of the Straw Hat Pirates. He is the sixth member of the crew and the fifth to join, doing so at the end of the Drum Island Arc. He was temporarily forced to join the Foxy Pirates during the Long Ring Long Land Arc, but was quickly returned to Luffy's crew.  Chopper is a reindeer that ate the Hito Hito no Mi, a Devil Fruit that allows its user to transform into a human hybrid or a human at will. He came from Drum Island and was taught how to be a doctor by his two parental figures, Doctors Hiriluk and Kureha. His dream is to one day become a doctor capable of curing any disease and wants to travel all across the world specifically in the hopes of accomplishing this dream.",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Fighter - Use devil fruit power + medicinal skill",
          "avatar": "chopper_avatar.png",
          "bounty": 1500000
        },
        {
          "name": "Usopp",
          "crewName": "Usopp",
          "name_jp": "ウソップ",
          "image": "usopp.jpg",
          "origin": "East Blue",
          "age": "19",
          "position": "Sniper",
          "devilfruit": "None",
          "summary": "\"God\" Usopp is the sniper of the Straw Hat Pirates. He is the fourth member of the crew and the third to join, doing so at the end of the Syrup Village Arc. Although he left the crew during the Water 7 Arc, he rejoined at the end of the Post-Enies Lobby Arc.[17]  Usopp is the son of Yasopp and Banchina. He was born and raised in Syrup Village, serving as \"captain\" of the Usopp Pirates and being Kaya's close friend. After working with the Straw Hats to defeat Kuro and the Black Cat Pirates, he was invited to join the crew. Despite his usual cowardice, Usopp dreams of becoming a brave warrior of the sea just like his father and lives every day in pursuit of living up to this dream.  He currently has a bounty of Beli.png200,000,000.[15]",
          "crew": "Straw Hat",
          "crew_img": "strawhat.jpg",
          "battling": "Sniper - Use slingshot + plants",
          "avatar": "usopp_avatar.jpg",
          "bounty": 1500000
        }
      ]
    },
    {
      "name": "Heart",
      "totalBounty": 35000000,
      "image": "heart.jpeg",
      "members": [
        {
          "name": "Trafalgar D. Water Law",
          "crewName": "Trafalgar D. Water Law",
          "name_jp": "トラファルガー・Dディー・ワーテル・ロー",
          "image": "law.jpg",
          "origin": "North Blue",
          "age": "26",
          "position": "Captain",
          "devilfruit": "Ope Ope no Mi",
          "summary": "Law is a slim young man of a relatively tall height. He has faint shadows right under his yellow eyes (grey in the anime), and his face is usually seen with a smirk. He wears a northern-style fur hat, which is white and has a spotted pattern along the bottom and the bill. He has short dark hair, a majority of which is obscured by his hat, save for his sideburns and a small goatee.[1] His hair color is depicted as black in both the anime and manga, though sometimes the manga depicts it as blue. He has many tribal-style tattoos on his arms; on both of his hands are letters spelled as D E A T H tattooed in black on each of the back of his fingers. Originally in the manga, his right hand was not tattooed[21] while his left thumb had the letter A missing.[1] Later on, all of his fingers were tattooed completely with all five letters.[22] He also has a black cross on the back of both of his hands.[1] On his chest, he has a tribal-style heart tattoo with his Jolly Roger on it. He has a simpler heart tattoo on his shoulders and his Jolly Roger tattooed on his back.[23]",
          "crew": "Heart",
          "crew_img": "heart.jpeg",
          "battling": "Swordman - Use devil fruit power + sword",
          "avatar": "law_avatar.jpg",
          "bounty": 3000000
        }
      ]
    },
    {
      "name": "Kid",
      "totalBounty": 45000000,
      "image": "kidpirates.jpg",
      "members": [
        {
          "name": "Eustass Kid",
          "crewName": "Eustass Kid",
          "name_jp": "ユースタス・キッド",
          "image": "kid.jpg",
          "origin": "South Blue",
          "age": "23",
          "position": "Captain",
          "devilfruit": "Jiki Jiki no Mi",
          "summary": "Kid is a tall, muscular man with light skin and bright red hair, resembling flames. His nose has a particular shape, being quite pointed and having little protrusions on both sides. He has dark reddish purple colored lips and fingernails, red/orange eyes and no eyebrows. He dresses in an extravagant attire consisting of black and yellow lizard-print pants with a red fringe, motorcycle boots, and a blue sash under a green belt fastened by a large circular buckle with a four-leaf clover-like pattern in the middle. He also has a slim bandolier, also with minuscule bolts that go diagonally over his right shoulder then ties to his waist, where he keeps a dagger with a Japanese-style hilt and what appears to be a flintlock gun. He also has gold bangles around both wrists. He wears a pair of studded, square shaped goggles on his forehead, and a large fur captain's coat over his bare muscular torso. The dark brown coat is adorned with spikes on its shoulders lined in maroon. The collar of the coat is extremely flared and wide. He typically wears this coat with his right arm in its sleeve and his left arm under the coat itself.[1]",
          "crew": "Kid",
          "crew_img": "kidpirates.jpg",
          "battling": "Fighter - Use devil fruit power + sword",
          "avatar": "kid_avatar.png",
          "bounty": 3000000
        }
      ]
    }
  ]
}
